<h1>Heroes of Pymoli Data Analysis</h1>

<ul><li>Point 1<ul><li>Point 1A</ul><li>Point 2<li>Point 3</ul>

<img src="https://media.giphy.com/media/AeUm5FEayfiV2/giphy.gif" align="left">

In [111]:
#import 
import pandas as pd
import numpy as np
rawpurchasedata = "purchase_data.json"
sales_data = pd.read_json(rawpurchasedata)

sales_data.head(5)

   Age Gender  Item ID                 Item Name  Price          SN
0   20   Male       93  Apocalyptic Battlescythe   4.49     Iloni35
1   21   Male       12                     Dawne   3.36   Aidaira26
2   17   Male        5                Putrid Fan   2.63      Irim47
3   17   Male      123         Twilight's Carver   2.55     Irith83
4   22   Male      154              Feral Katana   4.11  Philodil43

<c><h3>Player Count</h3></c>

In [71]:

pc_df = pd.DataFrame(
    {"Players Count": [sales_data["SN"].nunique()]
    })

pc_df

   Players Count
0             74

<c><h3>Purchasing Analysis (Total)</h3></c>

In [112]:
#s = pd.Series(sales_data["Item Name"])

uniqueitems = sales_data["Item Name"].nunique()
average_price = [np.round(sales_data["Price"].mean(), 2)]
number_of_purchases = [sales_data["Price"].count()]
total_revenue =  [sales_data["Price"].sum()]



pa_df = pd.DataFrame(
    {"Number of Unique Items": uniqueitems ,"Average Price": average_price , 
     "Number of Purchases": number_of_purchases,"Total Revenue": total_revenue
    
    })

pa_df["Average Price"] = pa_df["Average Price"].map("${:.2f}".format)
pa_df["Total Revenue"] = pa_df["Total Revenue"].map("${:.2f}".format)

pa_df[['Number of Unique Items','Average Price','Number of Purchases','Total Revenue']]

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                      63         $2.92                   78       $228.10

In [74]:
gender_count = pd.DataFrame(sales_data["Gender"].value_counts())
total=sales_data['Gender'].count()
gender_count.rename = gender_count.rename(columns={"Gender": "Total Count"})


gender_percentage = pd.DataFrame(((sales_data["Gender"].value_counts())/total)*100)
gender_percentage["Gender"] = gender_percentage["Gender"].map("{:.2f}%".format)
gender_percentage.rename = gender_percentage.rename(columns={"Gender": "Percentage of Players"})

ga = pd.concat([gender_percentage.rename, gender_count.rename], axis=1,ignore_index=False)
ga

                      Percentage of Players  Total Count
Male                                 82.05%           64
Female                               16.67%           13
Other / Non-Disclosed                 1.28%            1

In [110]:
ga2_purchase_count = sales_data.groupby(["Gender"])["Price"].count()
ga2_avg_puchase_price = sales_data.groupby(["Gender"])["Price"].mean()
ga2_ttl_purchase_price = sales_data.groupby(["Gender"])["Price"].sum()
ga2_nmlzd_totals = ga2_purchase_count/total_purchase_value.count()

ga2_avg_puchase_price = ga2_avg_puchase_price.map("${:,.2f}".format)
ga2_ttl_purchase_price = ga2_ttl_purchase_price.map("${:,.2f}".format)
ga2_nmlzd_totals= ga2_nmlzd_totals.map("${:,.2f}".format)

ga2 = pd.DataFrame({"Purchase Count": ga2_purchase_count,
                    "Average Purchase Price":ga2_avg_puchase_price,
                    "Total Purchase Value":ga2_ttl_purchase_price,
                    "Normalized Totals":ga2_nmlzd_totals})
ga2 = ga2.round(2)

ga2[['Purchase Count','Average Purchase Price','Total Purchase Value','Normalized Totals']]

,Purchase Count,Average Purchase Price,Total Purchase Value,Normalized Totals
Gender,,,,
Female,13,$3.18,$41.38,$4.33
Male,64,$2.88,$184.60,$21.33
Other / Non-Disclosed,1,$2.12,$2.12,$0.33

In [166]:

age_demo=pd.DataFrame(
    {"Age": sales_data['Age'],"Percentage of Players": sales_data['Age'],"Players Count": sales_data['Age']})


def agerange_func(row):
    if row['Age'] < [10]:
        val = "<10"
    elif(row['Age'] >=[10]) & (row['Age'] <[14]):
        val = "10-14"
    elif(row['Age'] >=[15]) & (row['Age'] <[19]):
        val = "15-19"   
    elif(row['Age'] >=[20]) & (row['Age'] <[24]):
        val = "20-24"  
    elif(row['Age'] >=[25]) & (row['Age'] <[29]):
        val = "25-29"  
    elif(row['Age'] >=[30]) & (row['Age'] <[34]):
        val = "30-34"  
    elif(row['Age'] >=[35]) & (row['Age'] <[39]):
        val = "35-39"  
    else:
        val = "40+"  
    return val
age_demo['Age'] = age_demo.apply(agerange_func, axis=1)
age_demo
age_demo.groupby("Age",as_index=False,)["Players Count"].count()

#age_demo2 = pd.DataFrame(age_demo)
#age_demo2.groupby(["Age"])["Players Count"].count()

     Age  Players Count
0  10-14              3
1  15-19             11
2  20-24             29
3  25-29              9
4  30-34              6
5  35-39              5
6    40+             10
7    <10              5